export const cardList = [
  {
    name: 'CPU',
    icon: 'el-icon-cpu',
  },
  {
    name: '内存',
    icon: 'el-icon-tickets',
  },
  {
    name: '服务器信息',
    icon: 'el-icon-monitor',
  },
  {
    name: 'java虚拟机信息',
    icon: 'el-icon-coffee-cup',
  },
  {
    name: '磁盘状态',
    icon: 'el-icon-receiving',
  }
];

export const contentList = {
  CPU: {
    属性: ['总内存', '已用内存', '剩余内存', '使用率'],
    内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
    JVM: ['600M', '155.57M', '444.43M', '25.93%'],
  },
  内存: {
    属性: ['总内存', '已用内存', '剩余内存', '使用率'],
    内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
    JVM: ['600M', '155.57M', '444.43M', '25.93%'],
  },
  服务器信息: {
    属性: ['总内存', '已用内存', '剩余内存', '使用率'],
    内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
    JVM: ['600M', '155.57M', '444.43M', '25.93%'],
  },
  java虚拟机信息: {
    属性: ['总内存', '已用内存', '剩余内存', '使用率'],
    内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
    JVM: ['600M', '155.57M', '444.43M', '25.93%'],
  },
  磁盘状态: {
    属性: ['总内存', '已用内存', '剩余内存', '使用率'],
    内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
    JVM: ['600M', '155.57M', '444.43M', '25.93%'],
  },
};

export const contentList1 = {
  属性: ['总内存', '已用内存', '剩余内存', '使用率'],
  内存: ['7.31G', '3.09G', '4.22G', '42.29%'],
  JVM: ['600M', '155.57M', '444.43M', '25.93%'],
}