import request from '@/utils/request'

// 获取跑马灯list
export function queryNewsLists() {
  return Promise.resolve([
    {
      title: '项目中期检查预备会暨课题研发进展交流会',
      desc: '2021年10月14-16日，科技创新2030—“新一代人工智能”重大项目2018年立项项目“可泛化的领域知识学习与计算引擎”项目各子课题中期检查会议在浙江杭州金溪山庄召开。会议邀请业界专家与会，针对项目各子课题中期执行情况及中期成果进行检查，项目负责人、课题负责人、项目组骨干成员等40余人参加了会议。',
      img: require('@/assets/images/home/carousel1.png'),
    },
    {
      title: '项目中期检查预备会暨课题研发进展交流会',
      desc: '2021年10月14-16日，科技创新2030—“新一代人工智能”重大项目2018年立项项目“可泛化的领域知识学习与计算引擎”项目各子课题中期检查会议在浙江杭州金溪山庄召开。会议邀请业界专家与会，针对项目各子课题中期执行情况及中期成果进行检查，项目负责人、课题负责人、项目组骨干成员等40余人参加了会议。',
      img: require('@/assets/images/home/carousel3.png'),
    },
    {
      title: '项目中期检查预备会暨课题研发进展交流会',
      desc: '2021年10月14-16日，科技创新2030—“新一代人工智能”重大项目2018年立项项目“可泛化的领域知识学习与计算引擎”项目各子课题中期检查会议在浙江杭州金溪山庄召开。会议邀请业界专家与会，针对项目各子课题中期执行情况及中期成果进行检查，项目负责人、课题负责人、项目组骨干成员等40余人参加了会议。',
      img: require('@/assets/images/home/carousel4.png'),
    },
    {
      title: '项目中期检查预备会暨课题研发进展交流会',
      desc: '2021年10月14-16日，科技创新2030—“新一代人工智能”重大项目2018年立项项目“可泛化的领域知识学习与计算引擎”项目各子课题中期检查会议在浙江杭州金溪山庄召开。会议邀请业界专家与会，针对项目各子课题中期执行情况及中期成果进行检查，项目负责人、课题负责人、项目组骨干成员等40余人参加了会议。',
      img: require('@/assets/images/home/carousel5.png'),
    },
  ])
}